app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def show
    @school_class = SchoolClass.find_by(params[:id])

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
  def create
    @school_class = SchoolClass.find_by(params[:id])
    @school_class = SchoolClass.create(post_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def edit
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(params[:id])
    @school_class.update(post_params(:title, :room_number))