app/controllers/students_controller.rb

  def create
    @student = Student.find_by(params[:id])
    @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-09-24 04:06:21.868968"], ["updated_at", "2017-09-24 04:06:21.868968"]]

  def edit
    @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT 1

  def update
    @student = Student.find_by(params[:id])
    @student.update(post_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-09-24 04:12:10.348155"], ["id", 1]]